ThirdParty-v1912/swak4Foam-latest/Examples/runTimeCondition/simpleSwakCar/system/fieldAverage
fieldAverage1
{
    type            fieldAverage;
    libs            ("libfieldFunctionObjects.so");
    triggerStart    1;
    timeStart       500;
    controlMode     timeOrTrigger;
    writeControl    writeTime;
    fields
    (
        U
        {
            base        iteration;
            mean        on;
            prime2Mean  off;
        }
    );
}
